{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 48], "input_dtype": "int32", "input_dim": 2100, "output_dim": 50, "init": "uniform", "input_length": 48, "mask_zero": false, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, 34], "input_dtype": "int32", "input_dim": 2100, "output_dim": 50, "init": "uniform", "input_length": 34, "mask_zero": false, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "batch_input_shape": [null, null, 50], "input_dtype": "float32", "return_sequences": false, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 50, "input_length": null, "output_dim": 50, "init": "glorot_uniform", "inner_init": "orthogonal", "activation": "tanh", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}}, {"class_name": "RepeatVector", "config": {"name": "repeatvector_1", "trainable": true, "n": 48}}]}]}}, {"class_name": "GRU", "config": {"name": "gru_2", "trainable": true, "batch_input_shape": [null, null, 50], "input_dtype": "float32", "return_sequences": false, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 50, "input_length": null, "output_dim": 50, "init": "glorot_uniform", "inner_init": "orthogonal", "activation": "tanh", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "batch_input_shape": [null, 50], "input_dtype": "float32", "output_dim": 2, "init": "glorot_uniform", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 50}}], "keras_version": "1.2.2"}